---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarPropagation
source: html/1b27c2ef-e744-266b-a9b7-d34d4f1340ce.htm
---
# RebarPropagation Members

It will copy the source rebars, will align them to the destination face based on the source face and adapt them to destination host.